TAL_INT_GIT/Sample Data/Nupco/ASN_G3/Input/asn_g3_input_soap/asn_g3_input_soap

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
   <soapenv:Header />
   <soapenv:Body>
      <urn:Z_GRN_HOS_OUTBOUND>
         <!--Optional:-->
         <GRN_HOS_OUTBOUND>
            <!--Zero or more repetitions:-->
            <item>
               <NUPCO_PO_NO>4000000571</NUPCO_PO_NO>
               <NUPCO_PO_ITEM>10</NUPCO_PO_ITEM>
               <NUPCO_MATERIAL>5050160100211</NUPCO_MATERIAL>
               <DOC_DATE>2021-01-21</DOC_DATE>
               <POST_DATE>2021-01-21</POST_DATE>
               <MOVT_TYPE>101</MOVT_TYPE>
               <DEL_NOTE>123456</DEL_NOTE>
               <BILL_OF_LADDING>98746</BILL_OF_LADDING>
               <QUATITY>1</QUATITY>
               <PLANT>W2C1</PLANT>
               <STORAGE_LOC>1000</STORAGE_LOC>
               <MOH_COD />
               <VENDOR_BATCH>V9889</VENDOR_BATCH>
               <MANUF_DAT>2021-01-21</MANUF_DAT>
               <SLED_BBD>2021-01-24</SLED_BBD>
               <VENDOR_NO>110001</VENDOR_NO>
               <_--33PL_REF>3PL_REF</_--33PL_REF>
            </item>
			<item>
               <NUPCO_PO_NO>4000000571</NUPCO_PO_NO>
               <NUPCO_PO_ITEM>10</NUPCO_PO_ITEM>
               <NUPCO_MATERIAL>5050160100211</NUPCO_MATERIAL>
               <DOC_DATE>2021-01-21</DOC_DATE>
               <POST_DATE>2021-01-21</POST_DATE>
               <MOVT_TYPE>101</MOVT_TYPE>
               <DEL_NOTE>123456</DEL_NOTE>
               <BILL_OF_LADDING>98746</BILL_OF_LADDING>
               <QUATITY>1</QUATITY>
               <PLANT>W2C1</PLANT>
               <STORAGE_LOC>1000</STORAGE_LOC>
               <MOH_COD />
               <VENDOR_BATCH>V9889</VENDOR_BATCH>
               <MANUF_DAT>2021-01-21</MANUF_DAT>
               <SLED_BBD>2021-01-24</SLED_BBD>
               <VENDOR_NO>110001</VENDOR_NO>
               <_--33PL_REF>3PL_REF</_--33PL_REF>
            </item>
         </GRN_HOS_OUTBOUND>
      </urn:Z_GRN_HOS_OUTBOUND>
   </soapenv:Body>
</soapenv:Envelope>